#include <iostream>
#include <string>

int main()
{
    // Літерний рядок, який містить послідовність символів s0, …, sn, …
    std::string str = "firstOGOsecondAGA";

    // Цикл по всем символам рядка
    for (int i = 0; i < str.size(); i++)
    {
        // Перевіряємо, чи є серед сусідніх символів трійка "OGO" або "AGA"
        if ((str[i] == 'O' && str[i + 1] == 'G' && str[i + 2] == 'O') ||
            (str[i] == 'A' && str[i + 1] == 'G' && str[i + 2] == 'A'))
        {
            // Замінюємо трійку сусідніх букв "OGO" або "AGA" парою зірочок "**"
            str[i] = '*';
            str[i + 1] = '*';
            str[i + 2] = ' ';

            // Переходимо на наступну ітерацію циклу, щоб не перевіряти ще раз ту саму трійку символів
            i += 2;
        }
    }

    // Виводимо результуючий рядок
    std::cout << str << std::endl;

    return 0;
}
